# FabDbSwapOut Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabDbSwapOut Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Fabrication Database reload could not swap out for newer parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabDbSwapOut { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabDbSwapOut As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabDbSwapOut {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace